tap "browsh-org/browsh"
tap "chaosteil/tap"
tap "dagger/tap"
tap "dopplerhq/cli"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "jesseduffield/lazygit"
tap "morantron/tmux-fingers"
tap "ngrok/ngrok"
tap "oven-sh/bun"
tap "runpod/runpodctl"
tap "sachaos/todoist"
tap "supabase/tap"
tap "twilio/brew"
tap "weaveworks/tap"
tap "withgraphite/tap"
# Run your GitHub Actions locally
brew "act"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# New way to see and navigate directory trees
brew "broot"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Tool for emulating mouse and keyboard events
brew "cliclick"
# Cross-platform make
brew "cmake"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Isolated development environments using Docker
brew "docker-compose"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Run arbitrary commands when files change
brew "entr"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line tools for fly.io services
brew "flyctl"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# Easily access your Google Calendar(s) from a command-line
brew "gcalcli"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Assuan IPC Library
brew "libassuan"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# GNU grep, egrep and fgrep
brew "grep"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Handy way to save and run project-specific commands
brew "just"
# Simple terminal UI for git commands
brew "lazygit"
# Command-line utility to interact with linkerd
brew "linkerd"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# Run LogQL queries against a Loki server
brew "logcli"
# Package manager for the Lua programming language
brew "luarocks"
# Text-based web browser
brew "lynx"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Remote terminal application
brew "mosh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Cross-platform library for audio I/O
brew "portaudio"
# Object-relational database system
brew "postgresql@16", restart_service: :changed
# Password generator
brew "pwgen"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Rust toolchain installer
brew "rustup"
# Tool to build, change, and version infrastructure
brew "terraform"
# Free software distribution for the TeX typesetting system
brew "texlive"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The modern, text-based browser
brew "browsh-org/browsh/browsh"
# doist is an unofficial command line app for interacting with the Todoist API
brew "chaosteil/tap/doist"
# The official Doppler CLI for managing your secrets
brew "dopplerhq/cli/doppler"
# mouseless terminal interaction
brew "morantron/tmux-fingers/tmux-fingers"
brew "runpod/runpodctl/runpodctl"
# Supabase CLI
brew "supabase/tap/supabase"
# unleash the power of Twilio from your command prompt
brew "twilio/brew/twilio"
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl"
# Allows you to manage your stacked changes and submit them for review on GitHub
brew "withgraphite/tap/graphite"
# Command-line interface for 1Password
cask "1password-cli"
# Audio utility
cask "background-music"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Containerized environments for coding agents
cask "container-use"
# Reimagine your terminal
cask "fig"
cask "font-commit-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspice-nerd-font"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Wine wrapper built with SwiftUI
cask "whisky"
vscode "akamud.vscode-theme-onedark"
vscode "asvetliakov.vscode-neovim"
vscode "bbrakenhoff.solarized-light-custom"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "dbaeumer.vscode-eslint"
vscode "doublebot.doublebot"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "iliazeus.vscode-ansi"
vscode "izcream.darkula"
vscode "mjmcloug.vscode-elixir"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "mtxr.sqltools"
vscode "pkief.material-icon-theme"
vscode "saoudrizwan.claude-dev"
vscode "sumneko.lua"
vscode "tal7aouy.theme"
vscode "trongthanh.theme-boxythemekit"
vscode "virgilsisoe.hammerspoon"
vscode "virgilsisoe.hammerspoon-snippets"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "whizkydee.material-palenight-theme"
vscode "zhuangtongfa.material-theme"
