# ============================================================================
# TAPS (Third-party repositories)
# ============================================================================

tap "jesseduffield/lazygit"
tap "supabase/tap"

# ============================================================================
# 🟢 ESSENTIAL - Core tools you definitely want
# ============================================================================

# Version Control
brew "git"                  # Distributed revision control system
brew "gh"                   # GitHub command-line tool
brew "git-lfs"              # Git extension for versioning large files
brew "lazygit"              # Simple terminal UI for git commands
brew "tig"                  # Text interface for Git repositories

# Shell & Terminal
brew "tmux"                 # Terminal multiplexer
brew "fzf"                  # Command-line fuzzy finder
brew "direnv"               # Load/unload environment variables based on $PWD
brew "zoxide"               # Smarter cd command
brew "atuin"                # Magical shell history (SQLite-backed, sync, stats)

# Modern CLI Replacements
brew "bat"                  # Better cat with syntax highlighting
brew "eza"                  # Modern replacement for ls
brew "fd"                   # Simple, fast alternative to find
brew "ripgrep"              # Fast search tool (better grep)
brew "xh"                   # Fast and friendly HTTP client (better curl)

# Editors
brew "neovim"               # Modern, extensible vim-based editor

# Essential Utilities
brew "entr"                 # Run commands when files change
brew "watch"                # Execute a program periodically, showing output fullscreen
brew "watchexec"            # Execute commands when files change (more flexible than entr)
brew "wget"                 # Internet file retriever
brew "gum"                  # Tool for glamorous shell scripts (used by bootstrap wizard)
brew "btop"                 # Modern resource monitor with beautiful graphs
brew "hyperfine"            # Command-line benchmarking tool
brew "just"                 # Command runner (like make but simpler)
brew "navi"                 # Interactive cheatsheet tool with variable prompts

# Markdown & Documentation
brew "glow"                 # Render markdown on the CLI
brew "tldr"                 # Simplified, community-driven man pages

# Security & Secrets
cask "1password-cli"        # Command-line interface for 1Password

# ============================================================================
# 🟡 DEVELOPMENT - Programming languages, tools, and cloud services
# ============================================================================

# Node.js & JavaScript
brew "fnm"                  # Fast Node.js version manager (use this to install node)

# Cloud & Deployment
brew "flyctl"               # Command-line tools for fly.io services
brew "supabase"             # Supabase CLI (from supabase/tap)
brew "lazydocker"           # Terminal UI for Docker commands

# Code Quality
brew "git-delta"            # Modern diff viewer with syntax highlighting

# ============================================================================
# 🟠 UTILITIES - Text processing and file navigation
# ============================================================================

# Text Processing & Search
brew "gnu-sed"              # GNU implementation of stream editor (macOS sed is BSD)
brew "grep"                 # GNU grep, egrep and fgrep
brew "moreutils"            # Collection of useful Unix tools (sponge, ts, etc.)
brew "yq"                   # YAML/JSON/XML processor (like jq for YAML)

# File Navigation
brew "broot"                # New way to see and navigate directory trees
brew "chafa"                # Versatile Unicode/ASCII/ANSI graphics renderer (terminal images)

# Utilities
brew "duti"                 # Select default apps for documents and URL schemes (macOS)
brew "rclone"               # Rsync for cloud storage

# ============================================================================
# 🔵 OPTIONAL - Specialized tools (only if you use these services/languages)
# ============================================================================

# Fonts (Nerd Fonts for terminal icons)
cask "font-commit-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspice-nerd-font"
