akamud.vscode-theme-onedark
asvetliakov.vscode-neovim
bbrakenhoff.solarized-light-custom
betterthantomorrow.calva
betterthantomorrow.calva-spritz
dbaeumer.vscode-eslint
doublebot.doublebot
dsznajder.es7-react-js-snippets
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
foxundermoon.shell-format
github.codespaces
github.copilot
github.copilot-chat
iliazeus.vscode-ansi
izcream.darkula
mjmcloug.vscode-elixir
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
mtxr.sqltools
pkief.material-icon-theme
saoudrizwan.claude-dev
sumneko.lua
tal7aouy.theme
trongthanh.theme-boxythemekit
virgilsisoe.hammerspoon
virgilsisoe.hammerspoon-snippets
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscodevim.vim
whizkydee.material-palenight-theme
zhuangtongfa.material-theme
